Repository: IsaacHuo/MyLeafy
Catalog: leafy/Localizable.xcstrings
Source language: zh_hans
Languages: en_us

source: 删除线
en_us: Strikethrough

source: 删除考研目标？
en_us: Delete Postgraduate Entrance Exam Goal?

source: 删除考试
en_us: Delete Exam

source: 删除自定日程
en_us: Delete custom schedule

source: 删除草稿
en_us: Delete draft

source: 删除被拒
en_us: Deletion rejected

source: 删除记录
en_us: Delete Record

source: 删除这份学习资料？
en_us: Delete this study material?

source: 删除这份材料？
en_us: Delete this material?

source: 删除这份草稿？
en_us: Delete this draft?

source: 删除这条台账？
en_us: Delete this ledger entry?

source: 删除这条帖子？
en_us: Delete this post?

source: 删除这条成绩
en_us: Delete this grade

source: 删除这条成绩？
en_us: Delete this grade?

source: 删除这条荣誉记录？
en_us: Delete this honor record?

source: 删除选项
en_us: Delete option

source: 刷新
en_us: Refresh

source: 刷新失败，请检查网络后重试
en_us: Refresh failed. Check your connection and try again.

source: 刷新完成
en_us: Refresh complete

source: 刷新完成，暂无内容
en_us: Refresh complete. No content yet.

source: 刷新排名
en_us: Refresh ranking

source: 刷新验证码
en_us: Refresh Verification Code

source: 前 %.0f%%
en_us: Previous %.0f%%

source: 前 30 天和最近 30 天都没有记录。
en_us: No records in either the previous or latest 30 days.

source: 前 30 天暂无记录。
en_us: No records in the previous 30 days.

source: 前往 App Store 下载 EasyConnect
en_us: Go to App Store to download EasyConnect

source: 前往缓存与同步页面重新同步教务课表
en_us: Go to the cache and sync page to resync the course schedule

source: 前往设置
en_us: Go to settings

source: 剩余学期
en_us: Remaining Semesters

source: 加权均分
en_us: Weighted average score

source: 加权均分趋势
en_us: Weighted average score trend

source: 加载中
en_us: loading

source: 加载图片失败：%@
en_us: Failed to Load Image: %@

source: 加载头像失败：%@
en_us: Failed to Load Avatar: %@

source: 加载更多
en_us: load more

source: 加载更多评论
en_us: Load more comments

source: 加载照片失败：%@
en_us: Failed to Load Photo: %@

source: 加载背景图失败：%@
en_us: Failed to Load Background Image: %@

source: 医疗事项
en_us: Health

source: 医疗台账
en_us: Medical ledger

source: 医疗台账操作
en_us: Medical ledger operations

source: 医疗台账筛选
en_us: Medical ledger filtering

source: 医院
en_us: Hospital

source: 匿名、待审核和隐藏内容不会出现在个人主页。
en_us: Anonymous, pending review, and hidden content will not appear on the personal homepage.

source: 匿名发布
en_us: Post anonymously

source: 匿名同学
en_us: Anonymous Student

source: 单位：%@
en_us: Unit: %@

source: 单位：%arg
en_us: Unit: %arg

source: 单条帖子最多上传 %d 张图片。
en_us: A single post can upload up to %d images.

source: 单次导入总大小不能超过 100 MB。
en_us: The total size of a single import cannot exceed 100 MB.

source: 卡片
en_us: Card

source: 历史最长连续
en_us: Longest streak ever

source: 原日程已不可用
en_us: The original schedule is no longer available

source: 参考比例：%@
en_us: Reference scale: %@

source: 参考比例：%arg
en_us: Reference ratio: %arg

source: 反馈已提交。
en_us: Feedback Submitted.

source: 发布
en_us: Publish

source: 发布一个单选投票，大家投完后就能看到统计。
en_us: Publish a single-choice poll, and everyone can see the statistics after voting.

source: 发布中
en_us: Publishing

source: 发布任务
en_us: Publish task

source: 发布前需要先同意社区条款。
en_us: You need to agree to the community terms before publishing.

source: 发布后会自动出现在这里。
en_us: It will automatically appear here after publishing.

source: 发布投票
en_us: Publish vote

source: 发布投票前需要先同意社区条款。
en_us: You need to agree to the community terms before publishing a poll.

source: 发布投票前需要先完善社区资料。
en_us: You need to complete your community profile before publishing a poll.

source: 发布类型
en_us: Publish type

source: 发生时间
en_us: Time of occurrence

source: 发送评论
en_us: Send a comment

source: 发送邀请
en_us: Send invitation

source: 发送验证码
en_us: Send Verification Code

source: 取消
en_us: Cancel

source: 取消任务
en_us: Cancel task

source: 取消发布
en_us: Cancel publishing

source: 取消收藏
en_us: Cancel collection

source: 取消收藏 %@
en_us: Uncollect %@

source: 取消点赞
en_us: Unlike

source: 取消置顶
en_us: Unpin

source: 取消聚焦
en_us: Unfocus

source: 只会显示在本周这一次课上。
en_us: Will only show up for this class this week.

source: 只共享课程安排，不包含成绩、考试、备注、提醒或收藏。
en_us: Only share the course schedule; does not include grades, exams, notes, alerts, or collections.

source: 只更新已发布的课程安排，不会生成新的邀请码
en_us: Only update the published course schedule; will not generate a new invitation code.

source: 可以从教务系统导出表格后按模板整理；也可以先只使用课表和考试功能。
en_us: You can export the table from the educational administration system and organize it according to the template; you can also only use the class schedule and examination functions first.

source: 可以分享今日课表，或切换周次查看后续安排。
en_us: You can share today's schedule or switch weeks to see upcoming arrangements.

source: 可以去发现页找自习室或查看考试安排。
en_us: You can go to the discovery page to find study rooms or check exam schedules.

source: 可以查看你的共享课表
en_us: You can view your shared schedule.

source: 可以直接取消某一周，适合节假日停课或中间断周的课程。
en_us: You can directly cancel a specific week, suitable for holidays or courses interrupted in the middle of the term.

source: 可以稍后重试。若刚启用 WeatherKit，请确认开发者后台已同时开启 capability 和 App Service。
en_us: You can try again later. If you just enabled WeatherKit, please make sure the capability and App Service are both enabled in the developer console.

source: 可以记录复习章节、资料整理、刷题或考试准备。
en_us: Can record review chapters, organizing materials, practicing questions, or exam preparation.

source: 可以记录改简历、投递、联系导师或面试准备。
en_us: Can record updating resumes, submissions, contacting mentors, or interview preparation.

source: 可同时选择多个提前量；自定义范围为 1 分钟至 7 天。
en_us: Multiple lead times can be selected simultaneously; custom range is 1 minute to 7 days.

source: 可继续查看其他日期或切换周次。
en_us: You can continue to view other dates or switch weeks.

source: 可选：说明投票背景或限制条件。
en_us: Optional: explain the background or restrictions of the vote.

source: 台账和票据照片只保存在当前设备。建议不要记录不必要的敏感细节，导出压缩包后请自行保管。
en_us: Ledger and receipt photos are only stored on the current device. It is recommended not to record unnecessary sensitive details, and after exporting the compressed package please keep it yourself.

source: 同学的课表
en_us: Classmates' schedule

source: 同意
en_us: agree

source: 同意后可继续使用社区功能。
en_us: After agreeing, you can continue to use community functions.

source: 同步失败：%@
en_us: Sync failed: %@

source: 同步完成，学校当前没有返回成绩记录。
en_us: Sync completed. The school currently returned no grade records.

source: 同步完成，学校当前没有返回课程安排。
en_us: Sync completed, the school currently returned no course schedule.

source: 同步完成，已刷新演示教学计划和培养方案。
en_us: Sync complete. Demo teaching plan and training program refreshed.

source: 同步完成，已加载示例课表。
en_us: Sync completed, sample schedule loaded.

source: 同步完成，成绩已是最新，共 %d 条。
en_us: Sync complete. Grades are up to date with %d records.

source: 同步完成，获取到 %d 条成绩。
en_us: Sync complete. Fetched %d grade records.

source: 同步官方排名
en_us: Sync official rankings

source: 同步成绩
en_us: Sync grades

source: 同步教务数据
en_us: Sync academic data

source: 同步教务系统中的最新课表
en_us: Sync the latest schedule from the academic system

source: 同步教学与培养
en_us: Sync teaching and training

source: 同步结果：%@。
en_us: Sync result: %@.

source: 同步考试安排
en_us: Sync exams

source: 同步课表
en_us: Sync schedule

source: 名次
en_us: Ranking

source: 后续安排
en_us: Subsequent arrangements

source: 否
en_us: No

source: 周一
en_us: Monday

source: 周三
en_us: Wednesday

source: 周二
en_us: Tuesday

source: 周五
en_us: Friday

source: 周六
en_us: Saturday

source: 周四
en_us: Thursday

source: 周日
en_us: Sunday

source: 周末去哪
en_us: Explore

source: 周次
en_us: Week number

source: 周次：%@
en_us: Week number: %@

source: 周次：第 %d 周
en_us: Week number: week %d

source: 周次待定
en_us: Week Undetermined

source: 回到
en_us: Back to

source: 回到本周
en_us: Back to this week

source: 回复 @%@
en_us: Reply @%@

source: 回复 @%arg
en_us: Reply @%arg

source: 回复 %@
en_us: Reply %@

source: 回复 %arg
en_us: Reply %arg

source: 回收站
en_us: Recycle Bin

source: 回收站为空
en_us: Recycle Bin is empty

source: 图书馆座位预约
en_us: Reserve a Library Seat

source: 图文卡片
en_us: Image and text card

source: 图文卡片内容过长，无法生成清晰的单张长图。请精简正文或图片后重试。
en_us: The content of the graphic card is too long to generate a clear single long image. Please simplify the text or images and try again.

source: 图文卡片写入失败：%@
en_us: Failed to write image and text card: %@

source: 图文卡片生成失败，请稍后重试。
en_us: Failed to generate graphic card, please try again later.

source: 图文长图已保存到系统相册。
en_us: Long graphic has been saved to the system album.

source: 图片
en_us: Image

source: 图片只包含本机汇总统计，不包含随记正文和标签名称。
en_us: Images only include local summary statistics, not diary content and tag names.

source: 图片和附件也会从本机删除，此操作无法撤销。
en_us: Images and attachments will also be deleted from the local device, this action cannot be undone.

source: 图片已无法读取
en_us: Image is no longer available

source: 图片文件无法读取，请重新生成。
en_us: Cannot read image file, please regenerate.

source: 图片无法加载
en_us: Image cannot be loaded

source: 在 App 内浏览器中打开
en_us: Open in in-app browser

source: 在下方快速记下一句话、一个想法或一张图片。
en_us: Jot down a quick quote, idea, or image below.

source: 在校内
en_us: On campus

source: 在校外
en_us: Off campus

source: 在这里集中完成手动添加课程、CSV 导入，以及清空当前通用入口本机课表数据。
en_us: Manually adding courses, CSV import, and clearing the current universal portal local course schedule data are all completed here.

source: 在随记正文中输入 #标签 即可自动整理。
en_us: Enter #tag in the diary content to automatically organize.

source: 地点
en_us: Location

source: 地点：%@
en_us: Location: %@

source: 地点（可选）
en_us: Location (optional)

source: 地点待定
en_us: Location Undetermined

source: 场馆开放
en_us: Venue open

source: 均分
en_us: Divide equally

source: 培养方案
en_us: Training plan

source: 培养方案 %d 类
en_us: Training Program %d Category

source: 培养方案失败
en_us: Training Program Failed

source: 培养方案失败：%@
en_us: Training program failed: %@

source: 培养方案已更新
en_us: Training program updated

source: 培养方案明细页面返回了登录页。
en_us: Training Program detail page returned to login page.

source: 基本信息
en_us: Basic information

source: 备注
en_us: Notes

source: 备注：%@
en_us: Note: %@

source: 备注（可选）
en_us: Notes (optional)

source: 备注已保存。
en_us: Note Saved.

source: 备注已删除。
en_us: Note Deleted.

source: 备注已清空。
en_us: Note Cleared.

source: 备注范围
en_us: Note range

source: 复制投稿内容
en_us: Copy submission content

source: 复制投稿邮箱
en_us: Copy submission email

source: 复制标题
en_us: Copy title

source: 复制正文
en_us: Copy text

source: 复制邀请码
en_us: Copy invitation code

source: 外观
en_us: Appearance

source: 多云
en_us: Cloudy

source: 天气
en_us: Weather

source: 天气加载中
en_us: Loading weather

source: 天气建议
en_us: Weather advice

source: 天气建议，%@
en_us: Weather advice, %@

source: 天气建议，%arg
en_us: Weather advice, %arg

source: 天气建议，体感温度 %@
en_us: Weather advice, feels like %@

source: 天气暂不可用
en_us: Weather conditions are temporarily unavailable

source: 失败
en_us: Failed

source: 头像和主页背景都可以不填，未设置时使用默认样式。
en_us: Avatar and homepage background are optional. If not set, default styles will be used.

source: 好
en_us: Alright

source: 好的
en_us: Okay

source: 如果重新登录页暂时无法加载验证码，请先确认校园网或北林 VPN 已连接，再点击验证码区域重试。
en_us: If the verification code cannot be loaded on the re-login page, please first confirm that the campus network or Beilin VPN is connected, then click the verification code area to try again.

source: 如需举报不当活动、违规内容或滥用用户，可以在“举报与反馈”中选择“社区安全”，也可以发送邮件到 %@。
en_us: To report inappropriate activity, illegal content, or abusive users, you can select "Community Safety" in "Report and Feedback" or send an email to %@.

source: 如需举报不当活动、违规内容或滥用用户，可以在“举报与反馈”中选择“社区安全”，也可以发送邮件到 %arg。
en_us: If you want to report inappropriate activities, violating content, or user abuse, you can select "Community Safety" under "Report & Feedback" or send an email to %arg.

source: 始终使用浅色外观
en_us: Always use light appearance

source: 始终使用深色外观
en_us: Always use dark appearance

source: 字号
en_us: font size

source: 字号会影响全局文本、课表卡片和常用控件尺寸。
en_us: The font size affects global text, timetable cards, and commonly used control sizes.

source: 存入草稿箱
en_us: Saved in the draft box

source: 学业部分
en_us: Academic section

source: 学习内容
en_us: Learning content

source: 学习空间
en_us: Spaces

source: 学习空间内容
en_us: Learning space content

source: 学习空间操作失败
en_us: Learning Space operation failed

source: 学习记录
en_us: Learning record

source: 学习资料
en_us: Learning materials

source: 学习资料操作失败
en_us: Learning materials operation failed

source: 学分
en_us: Credits

source: 学分需要填写为非负数字。
en_us: Credits must be filled in as non-negative numbers.

source: 学号
en_us: Student ID

source: 学号 %@
en_us: Student ID %@

source: 学号 %@ 已绑定，请先补全昵称。头像、学院和年级可选，未设置头像会使用默认头像。
en_us: Student ID %@ is already bound. Please complete the nickname first. Avatar, college, and grade are optional; if the avatar is not set, the default avatar will be used.

source: 学年
en_us: school year

source: 学期
en_us: Semester

source: 学期，例如 2025-2026-1
en_us: semester, for example, 2025-2026-1

source: 学期段排名记录较少，暂时无法形成折线趋势。
en_us: There are few ranking records for the semester segment, so a linear trend cannot form for now.

source: 学期结束
en_us: Semester Ends

source: 学校
en_us: School

source: 学校全称
en_us: Full school name

source: 学校官方
en_us: Official school

source: 学校官方 GPA 当前只按总览展示，未解析到学期拆分时不绘制 GPA 趋势。
en_us: The school's official GPA is currently only displayed as an overview; GPA trends are not shown at semester breakdown without analysis.

source: 学校教学
en_us: Academics

source: 学校申请审核中
en_us: School application under review

source: 学校申请已提交，审核通过后会自动进入对应学校社区。
en_us: Your school application was submitted. You will automatically enter its community once it is approved.

source: 学校申请未通过。当前处于通用模式，社区功能暂不可用。
en_us: Your school application was not approved. Community features are unavailable while using general mode.

source: 学校社区
en_us: School Community

source: 学院
en_us: College

source: 学院官网
en_us: College official website

source: 完成
en_us: Done

source: 完成绑定
en_us: Complete binding

source: 完整打包导出
en_us: Export the complete package

source: 完整显示
en_us: Full display

source: 官方学分积
en_us: Official credit accumulation

source: 官方学年校历
en_us: Official academic year calendar

source: 官方所得学分
en_us: Official credits earned

source: 官方排名位于前 10%
en_us: Official ranking in the top 10%

source: 官方排名位于前 30%
en_us: Official ranking in the top 30%

source: 官方排名位于前 50%
en_us: Official ranking in the top 50%

source: 官方排名位于后 50%
en_us: Official ranking in the bottom 50%

source: 官方排名明细
en_us: Official ranking details

source: 官方结果
en_us: Official results

source: 实际报销
en_us: Actual reimbursement

source: 审核通过后，这个评分才会计入正式均分。
en_us: Only after approval will this score be counted as the official average score.

source: 宽松
en_us: Relaxed

source: 密码
en_us: Password

source: 密码至少需要 8 位。
en_us: Your password must be at least 8 characters.

source: 寒假
en_us: Winter Break

source: 对方发布的课表暂无课程。
en_us: The other party's posted schedule currently has no courses.

source: 导入
en_us: Import

source: 导入 CSV
en_us: Import CSV

source: 导入 PDF、图片、Word、PPT 或表格后，可预览、编辑和导出。
en_us: After importing PDFs, images, Word, PPTs, or tables, you can preview, edit, and export them.

source: 导入奖状、证书 PDF 或图片后，可补充标题、备注和日期。
en_us: After importing certificates, certificates, PDFs, or images, you can add titles, remarks, and dates.

source: 导入当前简历，可随时替换、备注和预览。
en_us: Import the current resume, and you can replace, note, and preview it at any time.

source: 导入成绩
en_us: Import the results

source: 导入简历
en_us: Import resume

source: 导入说明
en_us: Import instructions

source: 导出
en_us: Export

source: 导出 CSV 表格
en_us: Export the CSV table

source: 导出到本地日历
en_us: Export to local calendar

source: 导出到系统日历
en_us: Export to system calendar

source: 导出图片
en_us: Export image

source: 导出概览图片
en_us: Export overview image

source: 导出结果图片
en_us: Export result image

source: 导出综素测算
en_us: Export comprehensive evaluation

source: 导出范围
en_us: Export range

source: 导出记录日迹图片
en_us: Export record trail image

source: 导出课表
en_us: Export timetable

source: 导出随记
en_us: Export notes

source: 将移除本学期所有由 %@ 写入系统日历的课程、考试和提醒事件。
en_us: All courses, exams, and reminder events written to the system calendar by %@ for this semester will be removed.

source: 将移除本学期所有由 %arg 写入系统日历的课程、考试和提醒事件。
en_us: This will remove all courses, exams, and reminder events written to the system calendar by %arg for this semester.

source: 小雨
en_us: Light Rain

source: 尚未填写签名
en_us: Signature not yet filled in

source: 尚未导入简历
en_us: Resume not imported yet

source: 尚未选择照片
en_us: Photo not yet selected

source: 尝试次数
en_us: Attempt count

source: 就医场景
en_us: Medical visit scenario

source: 就医情景
en_us: Medical visit context

source: 就诊日期
en_us: Appointment date

source: 屏蔽
en_us: Block

source: 屏蔽后将不再看到该用户的帖子、评论和通知。
en_us: After blocking, you will no longer see posts, comments, or notifications from this user.

source: 屏蔽该用户
en_us: Block this user

source: 屏蔽该用户？
en_us: Block this user?

source: 岗位已保存。
en_us: Position saved.

source: 岗位已删除。
en_us: Position deleted.

source: 岗位已添加。
en_us: Position added.

source: 岗位或链接标题
en_us: Job or link title

source: 已与教务学号 %@ 绑定
en_us: Bound with academic student ID %@

source: 已与教务绑定
en_us: Bound with academic system

source: 已从系统日历清理本学期 %@ 课表事件：移除 %d 个。
en_us: Cleaned this semester's %@ schedule events from system calendar: Removed %d items.

source: 已保存到系统相册。
en_us: Saved to system album.

source: 已停止共享。
en_us: Sharing stopped.

source: 已关闭
en_us: Closed

source: 已关闭这门课的提醒。
en_us: Closed notifications for this course.

source: 已删除
en_us: Deleted

source: 已删除评论
en_us: Comment deleted

source: 已刷新演示学校数据。社区数据仍使用真实服务。
en_us: Demo school data refreshed. Community data still uses real service.

source: 已刷新演示成绩数据。
en_us: Demo grades data refreshed.

source: 已加入 %@ 社区。之后如需更换学校，请在个人资料中提交审核。
en_us: You joined the %@ community. To change schools later, submit a review request from your profile.

source: 已发布的内容会展示在这里
en_us: Published content will be displayed here

source: 已取得官方名次
en_us: Official ranking obtained

source: 已取消保存。
en_us: Save canceled.

source: 已取消收藏。
en_us: Favorite removed.

source: 已取消点赞。
en_us: Like removed.

source: 已完成教务实名
en_us: Academic verification completed.

source: 已导入 %d 份资料。
en_us: Imported %d pieces of information.

source: 已导入 %d 条成绩。
en_us: Imported %d grades.

source: 已导入 %d 条考试安排。
en_us: Imported %d exam schedules.

source: 已导入 %d 门课程。
en_us: Imported %d courses.

source: 已导出到系统日历：新增 %d 个，更新 %d 个，移除 %d 个。
en_us: Exported to system calendar: %d added, %d updated, %d removed.

source: 已屏蔽该用户。
en_us: User blocked.

source: 已展开
en_us: Expanded

source: 已归档目标
en_us: Archived goals

source: 已截止
en_us: Deadline

source: 已按 %@ 优先排序。
en_us: Prioritized by %@.

source: 已按 %arg 优先排序。
en_us: Sorted by %arg priority.

source: 已接入教务系统，可使用校园账号登录。
en_us: Connected to the academic system. Sign in with your campus account.

source: 已提交，等待审核。
en_us: Submitted, awaiting review.

source: 已收起
en_us: Collected

source: 已是最新
en_us: You're up to date

source: 已更新 %d 条内容
en_us: Updated %d items

source: 已标记全部通知为已读。
en_us: All notifications marked as read.

source: 已添加收藏。
en_us: Added to favorites.

source: 已确认记录：分数、官方结果、备注和材料记录都会留在当前设备。
en_us: Record confirmed: grades, official results, notes, and material records will remain on this device.

source: 已经到底了
en_us: Already at the bottom

source: 已置顶
en_us: Pinned

source: 已记录你的选择。
en_us: Your choice has been recorded.

source: 已跳过社区会话、条款、Feed 和通知初始化。
en_us: Community sessions, terms, feed, and notifications initialization have been skipped.

source: 已达成
en_us: Achieved

source: 已选择
en_us: Selected

source: 已选择新的主页背景，保存后生效。
en_us: New homepage background selected, will take effect after saving.

source: 已隐藏
en_us: Hidden

source: 帖子发布失败
en_us: Post failed to publish

source: 帖子发布失败，可在社区顶部任务条中重试。
en_us: The post could not be published. Try again from the task bar at the top of Community.

source: 帖子发布成功
en_us: Post successfully published

source: 帖子已不存在或不可见。
en_us: The post no longer exists or is not visible.

source: 帖子已删除。
en_us: Post deleted.

source: 帖子已发布。
en_us: Post published.

source: 帖子详情
en_us: Post details

source: 帮助与资源
en_us: Help and resources

source: 帮助中心
en_us: Help center

source: 常用标签
en_us: Common tags

source: 常用链接
en_us: Common links

source: 年份缩略
en_us: Year abbreviation

source: 年度视图
en_us: Year view

source: 应用提醒
en_us: App notifications

source: 建议先查看低分优先和高学分课程。
en_us: It is recommended to check out low-scoring priority and high-credit courses first.

source: 建议步骤
en_us: Suggested steps

source: 开启后别人只会看到“已完成教务实名”，不会显示姓名或学号。
en_us: When enabled, others will only see 'Academic verification completed' and not your name or student ID.

source: 开启本地提醒
en_us: Enable local notifications

source: 开始
en_us: Start

source: 开始专注
en_us: Start focusing

source: 开始估算
en_us: Start estimation

source: 开始录音
en_us: Start recording

source: 开始时间
en_us: Start time

source: 开始查询
en_us: Start query

source: 开始节次
en_us: Start session

source: 开始语音转写
en_us: Start speech transcription

source: 开放时间可能因教学任务、节假日或场馆安排调整，以现场/预约页面通知为准。
en_us: Opening hours may be adjusted due to teaching tasks, holidays, or venue arrangements. Please refer to on-site/booking page notifications.

source: 引用
en_us: Quote

source: 归档
en_us: Archive

source: 归档学习空间
en_us: Archive learning space

source: 当前
en_us: Current

source: 当前 Supabase 项目未启用邮箱登录，请先在后台开启 Email Auth。
en_us: Email sign-in is not enabled for this Supabase project. Enable Email Auth in the dashboard first.

source: 当前 Supabase 项目未开放邮箱验证码注册。
en_us: Email verification sign-up is not enabled for this Supabase project.

source: 当前为通用模式
en_us: Currently using general mode

source: 当前入口暂不支持共享课表
en_us: The current entry does not support shared schedules

source: 当前入口暂未开放社区评分
en_us: Community ratings are not yet open for the current entry

source: 当前入口的问题和建议也可以通过这里反馈。
en_us: Questions and suggestions about the current entrance can also be reported here.

source: 当前入口账号。学校相关数据保存在本机。
en_us: Current entrance account. School-related data is saved on this device.

source: 当前只有 1 个学期的成绩，暂时无法形成趋势。
en_us: There is only 1 semester's grades currently, unable to form a trend temporarily.

source: 当前周
en_us: Current week

source: 当前周期
en_us: Current period

source: 当前均分 %@，官方 GPA %@。可优先检查 %@（%.1f 学分）；%@。
en_us: Current average %@, official GPA %@. You can prioritize checking %@ (%.1f credits); %@.

source: 当前均分 %@，官方 GPA %@。可继续关注高学分课程；%@。
en_us: Current average %@, official GPA %@. You can continue to follow high-credit courses; %@.

source: 当前学期
en_us: Current semester

source: 当前已评 %arg 星，可直接修改。
en_us: %arg stars have been rated currently and can be modified directly.

source: 当前已评 %lld 星，可直接修改。
en_us: Currently it has %lld stars and can be modified directly.

source: 当前支持本科生和研究生账号登录，老师账号暂不支持。
en_us: Currently supports login for undergraduate and graduate accounts, teacher accounts are not supported for now.

source: 当前教务登录态不可用，请先连接校园网，再回到登录页重新登录。
en_us: Current academic login session is unavailable, please connect to the campus network first, then return to the login page to log in again.

source: 当前教务登录状态已失效，验证后会继续刚才的空教室查询。
en_us: Your academic system session has expired. The classroom query will continue after verification.

source: 当前教务登录状态已失效，验证后会继续刷新培养方案。
en_us: Your academic system session has expired. The training program refresh will continue after verification.

source: 当前教务登录状态已失效，验证后会继续刷新成绩。
en_us: Your academic system session has expired. The grade refresh will continue after verification.

source: 当前教务登录状态已失效，验证后会继续刷新教学计划。
en_us: Your academic system session has expired. The teaching plan refresh will continue after verification.

source: 当前教务登录状态已失效，验证后会继续刷新考试安排。
en_us: Your academic system session has expired. The exam refresh will continue after verification.

source: 当前教务登录状态已失效，验证后会继续刷新课表。
en_us: Your academic system session has expired. The schedule refresh will continue after verification.

source: 当前教务登录状态已失效，验证后会继续同步教学计划和培养方案。
en_us: Your academic system session has expired. Teaching plan and training program sync will continue after verification.

source: 当前教务登录状态已失效，验证后会继续本次同步。
en_us: Your academic system session has expired. This sync will continue after verification.
